In [ ]:
# Example using Pandas

üêº Getting Started with Pandas

In [1]:
import pandas as pd

In [2]:
print("Pandas version:", pd.__version__) #as of now, I have: Pandas version: 2.2.3

Pandas version: 2.2.3

üìã Create a DataFrame from a Dictionary

In [3]:
# Create a simple DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

df = pd.DataFrame(data)
display(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

üîç Basic Data Exploration

In [5]:
# Show the first few rows
df.head()

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [6]:
# Summary info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [7]:
# Summary statistics
df.describe()

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

üìå Select and Filter Data

In [9]:
# Select one column
df['Name']

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [10]:
# Filter rows where Age > 28
df[df['Age'] > 28]

      Name  Age         City
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

üõ† Add a New Column

In [11]:
# Add a new column: Age in 10 years
df['Age + 10'] = df['Age'] + 10
display(df)

      Name  Age         City  Age + 10
0    Alice   25     New York        35
1      Bob   30  Los Angeles        40
2  Charlie   35      Chicago        45